---
kind: method
id: M:Autodesk.Revit.DB.GroupSet.ForwardIterator
source: html/3e217ff7-7946-1036-78b3-ccab50f03c8b.htm
---
# Autodesk.Revit.DB.GroupSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual GroupSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.